20220113160623-network.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>network</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">network</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge08464d">概要</a></li>
<li><a href="#org0f56e1e">Memo</a>
<ul>
<li><a href="#orgba38242">ソケット通信</a></li>
<li><a href="#org26dafe7">プロキシ</a></li>
</ul>
</li>
<li><a href="#org545c327">Tasks</a>
<ul>
<li><a href="#org5d6791b"><span class="todo TODO">TODO</span> Amazon.co.jp: 日経ITエンジニアスクール TCP/IP最強の指南書 eBook : 日経NETWORK: Kindle Store</a></li>
</ul>
</li>
<li><a href="#org20ec482">Reference</a>
<ul>
<li><a href="#org9ce59ba">インフラエンジニアじゃなくても押さえておきたいSSHの基礎知識 - Qiita</a></li>
<li><a href="#orgead0d17">図解！ネットワークの7層を実務に当てはめてみた - Qiita</a></li>
<li><a href="#orgd8e42f4">プロフェッショナルIPv6（無料版） - Professional IPv6 - BOOTH</a></li>
<li><a href="#org086333a">コンピュータネットワーク - Wikipedia</a></li>
</ul>
</li>
<li><a href="#org3b31c97">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge08464d" class="outline-2">
<h2 id="orge08464d"><a href="#orge08464d">概要</a></h2>
<div class="outline-text-2" id="text-orge08464d">
<p>
コンピュータ・ネットワークは複数のコンピュータを接続する技術。
<a href="20210926151212-computer_science.html#ID-e3b48a23-21bc-4cdf-8395-052fab9fecb5">Computer Science</a>と関係が深い。
通常のWeb開発でこのレイヤーをいじることは多くないが、技術的背景を理解してないと解決できない種類の問題がある。
</p>
</div>
</div>
<div id="outline-container-org0f56e1e" class="outline-2">
<h2 id="org0f56e1e"><a href="#org0f56e1e">Memo</a></h2>
<div class="outline-text-2" id="text-org0f56e1e">
</div>
<div id="outline-container-orgba38242" class="outline-3">
<h3 id="orgba38242"><a href="#orgba38242">ソケット通信</a></h3>
<div class="outline-text-3" id="text-orgba38242">
<blockquote>
<p>
TCP/IPのソケット通信とは、ソケットインターネットとも呼ばれ、主にプログラムの世界とTCP/IP世界を結ぶ特別な出入り口のことを意味し、TCP/IPのトランスポート層を指します。
</p>
</blockquote>
<p>
<a href="https://www.itmanage.co.jp/column/tcp-ip-protocol/#:~:text=TCP%2FIP%E3%81%AE%E3%82%BD%E3%82%B1%E3%83%83%E3%83%88%E9%80%9A%E4%BF%A1%E3%81%A8%E3%81%AF%E3%80%81%E3%82%BD%E3%82%B1%E3%83%83%E3%83%88%E3%82%A4%E3%83%B3%E3%82%BF%E3%83%BC%E3%83%8D%E3%83%83%E3%83%88%E3%81%A8%E3%82%82,%E7%94%A8%E3%81%84%E3%81%A6%E9%96%8B%E7%99%BA%E3%81%97%E3%81%BE%E3%81%99%E3%80%82">TCP/IPとは？通信プロトコルの階層モデルを図解で解説 | ITコラム｜アイティーエム株式会社</a>
</p>

<p>
<a href="20220414183922-nginx.html#ID-df013984-822e-439c-bffd-06a5a67ff945">Nginx</a>(webサーバ) + puma(アプリケーションサーバ) + <a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>の実例で考える。
</p>

<p>
<a href="20210509095946-rails.html#ID-e04aa1a3-509c-45b2-ac64-53d69c961214">Rails</a>でpumaを起動したときソケットパスを指定できる。起動すると、 <code>puma.sock</code> というファイルが作成される。
</p>

<p>
<a href="20220414183922-nginx.html#ID-df013984-822e-439c-bffd-06a5a67ff945">Nginx</a>の設定。
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>nginx.conf</label><pre class="src src-shell">upstream app_server {
  server unix:///rails/tmp/sockets/puma.sock;
}
</pre>
</div>

<p>
とすると、<a href="20220414183922-nginx.html#ID-df013984-822e-439c-bffd-06a5a67ff945">Nginx</a>を経由してpumaでサーブされる内容を表示できる。
ポートやプロセス関係は指定せずに2つのサーバが通信できていることに注目。
</p>
</div>
</div>

<div id="outline-container-org26dafe7" class="outline-3">
<h3 id="org26dafe7"><a href="#org26dafe7">プロキシ</a></h3>
<div class="outline-text-3" id="text-org26dafe7">
<p>
プロキシによって、サイトURLはそのままで違うURLのサイトを表示できる。
<a href="https://shiro-secret-base.com/?p=573">Nginx：proxy_passを使ってURLはそのままで違うサイトを表示する | Shiro&rsquo;s secret base</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org545c327" class="outline-2">
<h2 id="org545c327"><a href="#org545c327">Tasks</a></h2>
<div class="outline-text-2" id="text-org545c327">
</div>
<div id="outline-container-org5d6791b" class="outline-3">
<h3 id="org5d6791b"><a href="#org5d6791b"><span class="todo TODO">TODO</span> <a href="https://www.amazon.co.jp/dp/B073VDH5J8/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1">Amazon.co.jp: 日経ITエンジニアスクール TCP/IP最強の指南書 eBook : 日経NETWORK: Kindle Store</a></a></h3>
<div class="outline-text-3" id="text-org5d6791b">
<p>
TCP/IPの教科書的な本。
</p>
</div>
</div>
</div>
<div id="outline-container-org20ec482" class="outline-2">
<h2 id="org20ec482"><a href="#org20ec482">Reference</a></h2>
<div class="outline-text-2" id="text-org20ec482">
</div>
<div id="outline-container-org9ce59ba" class="outline-3">
<h3 id="org9ce59ba"><a href="#org9ce59ba"><a href="https://qiita.com/tag1216/items/5d06bad7468f731f590e">インフラエンジニアじゃなくても押さえておきたいSSHの基礎知識 - Qiita</a></a></h3>
<div class="outline-text-3" id="text-org9ce59ba">
<p>
SSHの仕組み。
</p>
</div>
</div>
<div id="outline-container-orgead0d17" class="outline-3">
<h3 id="orgead0d17"><a href="#orgead0d17"><a href="https://qiita.com/manamin0521/items/1df1ec65637ad1620329#%E3%82%A2%E3%83%97%E3%83%AA%E3%82%B1%E3%83%BC%E3%82%B7%E3%83%A7%E3%83%B3%E5%B1%A4">図解！ネットワークの7層を実務に当てはめてみた - Qiita</a></a></h3>
<div class="outline-text-3" id="text-orgead0d17">
<p>
ネットワークの7層がそもそもあまり理解できてないので、具体的に置き換えて考える。
</p>
</div>
</div>
<div id="outline-container-orgd8e42f4" class="outline-3">
<h3 id="orgd8e42f4"><a href="#orgd8e42f4"><a href="https://booth.pm/ja/items/913273">プロフェッショナルIPv6（無料版） - Professional IPv6 - BOOTH</a></a></h3>
<div class="outline-text-3" id="text-orgd8e42f4">
<p>
IPv6の本。
</p>
</div>
</div>
<div id="outline-container-org086333a" class="outline-3">
<h3 id="org086333a"><a href="#org086333a"><a href="https://ja.wikipedia.org/wiki/%E3%82%B3%E3%83%B3%E3%83%94%E3%83%A5%E3%83%BC%E3%82%BF%E3%83%8D%E3%83%83%E3%83%88%E3%83%AF%E3%83%BC%E3%82%AF">コンピュータネットワーク - Wikipedia</a></a></h3>
</div>
</div>
<div id="outline-container-org3b31c97" class="outline-2">
<h2 id="org3b31c97"><a href="#org3b31c97">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
